TOKEN = ''


ru_c_dict = {'рубл': ['RUB', 'ь', 'я', 'ей', ''],
             'доллар': ['USD', '', 'а', 'ов', ''],
             'евро': ['EUR', '', '', '', ''],
             'биткоин': ['BTC', '', 'а', 'ов', ''],
             'эфириум': ['ETH', '', 'а', 'а', '']}

ru_greeting_mess = [', здравствуйте! Вас приветствует Телеграм-бот. Он пока не умеет запоминать тех, с кем общался,'
                    ' так что будет стандартное приветствие в начале каждого сеанса общения.',
                    '. Привет еще раз. Виделись уже.', 'Ничего не понял, но рад общению.']

ru_err_mess = {'input': ["Запрос ни о чем, проверьте ввод.", "Указаны более двух валют.", "Не указана исходная валюта.",
                         "Не указана конечная валюта.", "Не найдено количество исходной.", "Нет сохраненных параметров."],
               'conversion': ["Перевод валюты из самой в себя не имеет смысла.", "Нужна обратная конвертация?"]}
            
ru_help_mess = ["   О боте:\n" \
               "   Бот сделан для перевода количества исходной валюты в количество конечной" \
               " (по данным CryptoCompare.com).\n" \
               "   Доступные команды:\n" \
               "      /start - приветствие + данный текст,\n" \
               "      /help - это повтор данного текста,\n" \
               "      /available - выводит список известных боту валют,\n" \
               "      /mem - повтор последнего запроса.\n",
               "   Запрос вида <исходная валюта (наименование)> <её количество> <конечная валюта(наименование)>" \
               " (разделены пробелами)," \
               " ответом будет число конечной валюты за заданное количество исходной.\n" \
               "   Если конвертация уже проводилась:\n" \
               "   Ввод одного названия валюты - замена конечной, ввод только числа - меняет количество исходной.\n" \
               "   Вввод текста без ключевых слов и числовых значений считается ошибкой."]
